Revit 2027 API
ParameterTypeId.FixedRotation Property
 "Fixed Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FixedRotation { get; }
Public Shared ReadOnly Property FixedRotation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FixedRotation {
	ForgeTypeId^ get ();
}
static member FixedRotation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace